<template>
  <el-row id="adv-row">
    <el-col>
      <div class="celem">
        <div class="subtitle">Добро пожаловать!</div>
        <div class="title-2">Будем рады видеть вас в нашем хостеле.</div>
      </div>
      <div class="text" v-for="r in row" :key="r.index">
        <AdvRow :index="r.index" :img="r.img" :text="r.text"/>
      </div>
    </el-col>
  </el-row>
</template>

<script>
import AdvRow from "./AdvRow.vue";

export default {
  components: {
    AdvRow
  },
  data() {
    return {
      row: [
        {
          index: 0,
          img: require("@/assets/adv1.png"),
          text:
            "&laquo;Радуга&raquo; находится недалеко от центра города в 5 минутах ходьбы от &laquo;Екатеринбург-Арены&raquo;.\
            Хостел славится не только своим уютом и гостеприимством, \
            но и замечательным расположением относительно основных элементов современной инфраструктуры города."
        },
        {
          index: 1,
          img: require("@/assets/adv2.png"),
          text:
            "Мы предоставляем высокий уровень комфорта. В вашем распоряжении сейф, стиральная машина, утюг и гладильная доска.\
            <p>Настольные игры и книги помогут скрасить досуг. Также у нас в продаже большой выбор сувениров и действует гибкая система скидок.</p>"
        },
        {
          index: 2,
          img: require("@/assets/adv3.png"),
          text:
            "Хостел располагает тремя номерами с двухъярусными кроватями, которые придутся на вкус любому путешественнику. \
              Возле каждой кровати есть индивидуальная розетка. \
              Бесплатный Wi-Fi на всей территории хостела. \
            <p>В хостеле имеется оборудованная общая кухня со всей необходимой техникой для самостоятельного приготовления пищи. На кухне имеется варочная поверхность, холодильник, микроволновая печь.</p> \
            <p>Имеются 2 санузла с душевыми кабинами, а также стиральная машина, фен и гладильная доска с утюгом. Гостям бесплатно предоставляются необходимые гигиенические средства.</p>"
        }
      ]
    };
  }
};
</script>

<style>
#adv-row {
  background-color: #eaffed;
}
</style>